{
    "issue": {
        "title": "💎 Refine subtree organize information",
        "created_at": "2024-04-16T05:00:00+02:00",
        "updated_at": "2024-08-11T18:34:00+02:00",
        "content": [
            {
                "body": [
                    {
                        "type": "text",
                        "body": "Follow up issue: Answer open questions and check definition again."
                    },
                    {
                        "type": "itemize",
                        "caption": "Previous Issues:",
                        "body": [
                            "#11"
                        ]
                    }
                ]
            },
            {
                "title": "Open questions",
                "body": [
                    {
                        "type": "boxes",
                        "caption": "15.04, Tree Iteration II:",
                        "body": [
                            "Merge organization und organize information (@rwarnking)"
                        ]
                    },
                    {
                        "type": "boxes",
                        "caption": "15.04, Tree Iteration IV:",
                        "body": [
                            "Does _info: hide_ have multiple meanings? (@rwarnking)",
                            [
                                "The player hides information or him self",
                                "The player can withhold information.",
                                "Examples: Among Us, Assassin's Creed, Thief, Hitman Absolution"
                            ],
                            "player highlights information vs information is highlighted for the player (@rwarnking) (Bridge Constructor)",
                            "New Tag: _info: connect_"
                        ]
                    }
                ]
            }
        ],
        "labels": [
            "effort:low",
            "priority:low"
        ],
        "milestone": 4
    },
    "comments": [
        {
            "content": [
                {
                    "title": "11.08 Discussion",
                    "body": [
                        {
                            "type": "text",
                            "body": "When using the tag _info: hide_ it was found, that there might be multiple interpretations when using this tag. Accordingly we shortly discussed the different interpretations and how to deal with these."
                        },
                        {
                            "type": "text",
                            "h4": "Info: hide self",
                            "body": "Some games are designs such that the player can or must hide himself to avoid detection, essentially hiding information. Even though this interpretation might be valid we proposed to add a subtree for stealth mechanics instead of adding it to _organize information_, since it more clearly depicts the intention of the action. This is also revealed that there could be similar game features that are not yet represented in the tree."
                        },
                        {
                            "type": "text",
                            "h4": "Info: keep from players",
                            "body": "In some games the players is required to keep informations from players to progress or win ([Among Us](https://store.steampowered.com/app/945360/Among_Us/), [Keep Talking and Nobody Explodes](https://store.steampowered.com/app/341800/Keep_Talking_and_Nobody_Explodes/)). Here it would be important to decide whether it is already sufficiently tagged by social deduction."
                        },
                        {
                            "type": "text",
                            "h4": "Info: keep from npcs",
                            "body": "This aims at dialog options that allow the player to lie or keep information from an npc. Even though this is technically possible games usualy only provide a predefined number of options to chose from, therefore strongly limiting the possibility of a player to lie. Furthermore these special cases could either be part of narrative quest choices or this could be a pentant to stealth mechanics."
                        },
                        {
                            "type": "text",
                            "h4": "Info: hide",
                            "body": "The final interpretation is the one that should be the actual understanding of this tag: Actively hide informationen, for example by removing information from screen, hiding or disabling information. This can apply when organizing the workspace in [Papers Please](https://store.steampowered.com/app/239030/Papers_Please/) or in questmenus where the player can hide quests or details about them. Note: This might be related to manage resources."
                        }
                    ]
                }
            ],
            "created_at": "2024-08-11T18:34:00+02:00"
        },
        {
            "content": [
                {
                    "title": "12.08 Discussion",
                    "body": [
                        {
                            "type": "text",
                            "body": "According to issue #35 we discussed the tag _info: hide_ since it was previously found to be unclear and allowing for multiple interpretations."
                        },
                        {
                            "type": "itemize",
                            "caption": "Including:",
                            "body": [
                                "Info: hide self",
                                "Info: keep from players",
                                "Info: keep from NPCs",
                                "Info: hide"
                            ]
                        },
                        {
                            "type": "text",
                            "body": "Firstly we clarified that the _organize information_ subtree would be targeted at what the player does, therefore directly differentiating from what the player character does. For example when the player is physically organizing information in the game. Furthermore according to already made propositions we tried to assign these interpretations to new or already present tags."
                        },
                        {
                            "type": "text",
                            "body": "Regarding _Info: hide self_ the proposition was to add a _stealth mechanics_ tag or tree, that would allow to tag this specific feature (game mechanics). Following this we discussed whether this might yield sibling trees that should be considered. This could include _info: keep_ since lying or leaving out information ([Among Us](https://store.steampowered.com/app/945360/Among_Us/), [Keep Talking and Nobody Explodes](https://store.steampowered.com/app/341800/Keep_Talking_and_Nobody_Explodes/)) is a similar feature. But since this would happen outside of the game these elements can not be considered as a game mechanic."
                        },
                        {
                            "type": "text",
                            "body": "Regarding _Info: keep from NPCs_ we decided that it would be to narrow in scope and would be covered by _moral and emotional challenges_ or _dialog options_ anyway."
                        },
                        {
                            "type": "text",
                            "body": "We concluded to start by adding _stealth mechanics_ and considered further options when the situation arises, since possible problems would most likely show themselves in the next tagging phase (for example _combat mechanics_). Still open is the parent tree of this tag which could either be _problem solving techniques_ or _game mechanics_. Furthermore a differentiation to _skill_ and _strategy_ must be made to clarify whether these mechanics might already be covered else where."
                        }
                    ]
                }
            ],
            "created_at": "2024-08-12T23:29:59+02:00"
        }
    ]
}
